Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E8C.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM4E8C-CU" package="LFBGA100" speedmax="120000000" tempmax="+85" tempmin="-40" vccmax="3.60" vccmin="1.62"/>
    <variant ordercode="ATSAM4E8C-AU" package="LQFP100" speedmax="120000000" tempmax="+85" tempmin="-40" vccmax="3.60" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAM4" name="ATSAM4E8C" series="SAM4E">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00400000" type="rom"/>
          <memory-segment name="IRAM" start="0x20000000" size="0x00020000" type="ram"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x10" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ACC" id="6490" version="C">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x400BC000"/>
          </instance>
        </module>
        <module name="AES" id="6149" version="J">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x40004000"/>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="A">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x400B0000"/>
            
          <signals>
              <signal pad="PA8" function="B" group="AFE0_ADTRG"/>
              <signal pad="PA17" function="X1" group="AFE0_AD" index="0"/>
              <signal pad="PA18" function="X1" group="AFE0_AD" index="1"/>
              <signal pad="PA19" function="X1" group="AFE0_AD" index="2"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AFE0_AD" index="3"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AFE0_AD" index="4"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
              <signal pad="PB1" function="X1" group="AFE0_AD" index="5"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PC13" function="X1" group="AFE0_AD" index="6"/>
              <signal pad="PC15" function="X1" group="AFE0_AD" index="7"/>
              <signal pad="PC12" function="X1" group="AFE0_AD" index="8"/>
              <signal pad="PC29" function="X1" group="AFE0_AD" index="9"/>
              <signal pad="PC30" function="X1" group="AFE0_AD" index="10"/>
              <signal pad="PC31" function="X1" group="AFE0_AD" index="11"/>
              <signal pad="PC26" function="X1" group="AFE0_AD" index="12"/>
              <signal pad="PC27" function="X1" group="AFE0_AD" index="13"/>
              <signal pad="PC0" function="X1" group="AFE0_AD" index="14"/>
            </signals>
          </instance>
