Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E8C.atdf
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Current SELection" mask="0x00000001" name="ISEL" values="ACC_ACR__ISEL"/>
          <bitfield caption="HYSTeresis selection" mask="0x00000006" name="HYST"/>
        </register>
        <register caption="Write Protect Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write PROTection ERRor" mask="0x00000001" name="WPROTERR"/>
        </register>
        </register-group>
      <value-group caption="" name="ACC_MR__SELMINUS">
        <value caption="SelectTS" name="TS" value="0x0"/>
        <value caption="Select ADVREF" name="ADVREF" value="0x1"/>
        <value caption="Select DAC0" name="DAC0" value="0x2"/>
        <value caption="Select DAC1" name="DAC1" value="0x3"/>
        <value caption="Select AD0" name="AD0" value="0x4"/>
        <value caption="Select AD1" name="AD1" value="0x5"/>
        <value caption="Select AD2" name="AD2" value="0x6"/>
        <value caption="Select AD3" name="AD3" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELPLUS">
        <value caption="Select AD0" name="AD0" value="0x0"/>
        <value caption="Select AD1" name="AD1" value="0x1"/>
        <value caption="Select AD2" name="AD2" value="0x2"/>
        <value caption="Select AD3" name="AD3" value="0x3"/>
        <value caption="Select AD4" name="AD4" value="0x4"/>
        <value caption="Select AD5" name="AD5" value="0x5"/>
        <value caption="Select AD6" name="AD6" value="0x6"/>
        <value caption="Select AD7" name="AD7" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__ACEN">
        <value caption="Analog Comparator Disabled." name="DIS" value="0"/>
        <value caption="Analog Comparator Enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__EDGETYP">
        <value caption="only rising edge of comparator output" name="RISING" value="0x0"/>
        <value caption="falling edge of comparator output" name="FALLING" value="0x1"/>
        <value caption="any edge of comparator output" name="ANY" value="0x2"/>
      </value-group>
      <value-group caption="" name="ACC_MR__INV">
        <value caption="Analog Comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog Comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELFS">
        <value caption="the CF flag is used to drive the FAULT output." name="CF" value="0"/>
        <value caption="the output of the Analog Comparator flag is used to drive the FAULT output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__FE">
        <value caption="the FAULT output is tied to 0." name="DIS" value="0"/>
        <value caption="the FAULT output is driven by the signal defined by SELFS." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_ACR__ISEL">
        <value caption="low power option." name="LOPW" value="0"/>
        <value caption="high speed option." name="HISP" value="1"/>
      </value-group>
    </module>
    <module name="AES" caption="Advanced Encryption Standard" id="6149" version="J">
      <register-group name="AES"><register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="Dual Input BUFFer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operation Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
        </register>
